# Спортсмен занимается ежедневными пробежками.
# В первый день его результат составил a километров.
# Каждый день спортсмен увеличивал результат на 10 % относительно предыдущего.
# Требуется определить номер дня, на который общий результат
# спортсмена составить не менее b километров. Программа должна принимать значения
# параметров a и b и выводить одно натуральное число — номер дня.

a = float(input("Please, enter result of first day\n"))
b = float(input("Please, enter result of last day\n"))
counter = 1
while a < b:
    a += a*0.1
    counter += 1
print(f"Total amount of days are: {counter}")
